blog/OS/systemd.org
#+TITLE:       Systemd
#+AUTHOR:      pinvon
#+EMAIL:       pinvon@t480
#+DATE:        2019-04-01 一

#+URI:         /blog/OS/%y/%m/%d/%t/ Or /blog/OS/%t/
#+TAGS:        Ubuntu
#+DESCRIPTION: <Add description here>

#+LANGUAGE:    en
#+OPTIONS:     H:4 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:t

* 概述

部分内容转自阮一峰老师的博客: http://www.ruanyifeng.com/blog/2016/03/systemd-tutorial-commands.html

在历史上, Linux 的启动一直采用 init 进程, init 是 Linux 内核加载后执行的第一个进程, 以串行的方式对服务进行管理(启动, 停止, 监控等).

缺点:
- 以串行方式管理服务, 没有利用多 CPU 特性, 启动慢;
- 只负责执行启动脚本, 脚本需要自己处理各种情况, 使得脚本变得很长;
- 未体现服务间的依赖性;
- 不同服务的启动顺序由服务本身设定, 且设定没有依据;

Systemd 的设计目标: 为系统的启动和管理提供一套完整的解决方案, d 的含义就是要守护整个系统. 使用 Systemd 后, Systemd 成为系统的第一个进程(PID=1), 其他进程都是它的子进程. 它是一组命令, 涉及到系统管理的方方面面.

* 系统管理

** 主命令 systemctl

#+BEGIN_EXAMPLE
sudo systemctl reboot  # 重启系统
sudo systemctl poweroff  # 关闭系统
sudo systemctl halt  # 停止 CPU
sudo systemctl suspend  # 暂停系统
sudo systemctl hibernate  # 休眠
...
#+END_EXAMPLE

** hostnamectl

查看当前主机的信息.

#+BEGIN_EXAMPLE
hostnamectl  # 显示当前主机信息
sudo hostnamectl set-hostname pinvon  # 设置主机名
#+END_EXAMPLE

** systemd-analyze

用于查看启动耗时.

#+BEGIN_EXAMPLE
systemd-analyze  # 查看启动耗时
systemd-analyze blame  # 查看每个服务的启动耗时
systemd-analyze critical-chain  # 显示瀑布状的启动过程流
systemd-analyze critical-chain atd.service  # 显示指定服务的启动流
#+END_EXAMPLE

** localectl

用于本地化管理.

#+BEGIN_EXAMPLE
localectl  # 查看本地化设置

# 设置本地化参数。
sudo localectl set-locale LANG=en_GB.utf8
sudo localectl set-keymap en_GB
#+END_EXAMPLE

** timedatectl

用于当前时间设置的管理.

#+BEGIN_EXAMPLE
timedatectl  # 查看当前时区设置
timedatectl list-timezones  # 显示所有可用的时区

# 设置当前时区
sudo timedatectl set-timezone America/New_York
sudo timedatectl set-time YYYY-MM-DD
sudo timedatectl set-time HH:MM:SS
#+END_EXAMPLE

** loginctl

用于查看当前登录用户.

#+BEGIN_EXAMPLE
loginctl list-sessions  # 列出当前session
loginctl list-users  # 列出当前登录用户
loginctl show-user ruanyf  # 列出显示指定用户的信息
#+END_EXAMPLE

* Unit

Systemd 可以管理所有系统资源, 资源统称为 Unit, 一共有 12 种.
#+BEGIN_EXAMPLE
Service Unit: 系统服务
Target Unit: 多个 Unit 构成的一个组
Device Unit: 硬件设备
Mount Unit: 文件系统的挂载点
Automount Unit: 自动挂载点
Path Unit: 文件或路径
Scope Unit: 不是由 Systemd 启动的外部进程
Slice Unit: 进程组
Snapshot Unit: Systemd 快照，可以切回某个快照
Socket Unit: 进程间通信的 socket
Swap Unit: swap 文件
Timer Unit: 定时器
#+END_EXAMPLE

关于 Unit 的命令:
#+BEGIN_EXAMPLE
systemctl list-units  # 列出正在运行的 Unit
systemctl list-units --all  # 列出所有Unit，包括没有找到配置文件的或者启动失败的
systemctl list-units --all --state=inactive  # 列出所有没有运行的 Unit
systemctl list-units --failed  # 列出所有加载失败的 Unit
systemctl list-units --type=service  # 列出所有正在运行的、类型为 service 的 Unit


systemctl status  # 显示系统状态
sysystemctl status bluetooth.service  # 显示单个 Unit 的状态
systemctl -H root@rhel7.example.com status httpd.service  # 显示远程主机的某个 Unit 的状态


systemctl is-active application.service  # 显示某个 Unit 是否正在运行
systemctl is-failed application.service  # 显示某个 Unit 是否处于启动失败状态
systemctl is-enabled application.service  # 显示某个 Unit 服务是否建立了启动链接


sudo systemctl start apache.service  # 立即启动一个服务
sudo systemctl stop apache.service  # 立即停止一个服务
sudo systemctl restart apache.service  # 重启一个服务
sudo systemctl kill apache.service  # 杀死一个服务的所有子进程
sudo systemctl reload apache.service  # 重新加载一个服务的配置文件
sudo systemctl daemon-reload  # 重载所有修改过的配置文件
systemctl show httpd.service  # 显示某个 Unit 的所有底层参数
systemctl show -p CPUShares httpd.service  # 显示某个 Unit 的指定属性的值
sudo systemctl set-property httpd.service CPUShares=500  # 设置某个 Unit 的指定属性


systemctl list-dependencies --all nginx.service  # 列出一个 Unit 的所有依赖
#+END_EXAMPLE
如果 Unit A 依赖于 Unit B, 则在启动 Unit A 时, 系统会同时去启动 Unit B.

* Unit 配置文件

每个 Unit 都有一个配置文件, 告诉 Systemd 如何启动该 Unit.

Systemd 默认从 /etc/systemd/system/ 读取配置文件, 但里面存放的大部分文件都是符号链接, 指向目录 /usr/lib/systemd/system/, 这才是真正的配置文件存放目录.

建立符号链接的命令:
#+BEGIN_EXAMPLE
sudo systemctl enable clamd@scan.service
# 等同于
sudo ln -s '/usr/lib/systemd/system/clamd@scan.service' '/etc/systemd/system/multi-user.target.wants/clamd@scan.service'
#+END_EXAMPLE
如果配置文件内部配置了开机启动, 则 systemctl enable 相当于激活开机启动, 对应的, 如果使用 systemctl disable 命令撤销符号链接关系, 则相当于撤销了开机启动.
#+BEGIN_EXAMPLE
sudo systemctl disable clamd@scan.service
#+END_EXAMPLE

** 配置文件的名称

配置文件的后缀名就是该 Unit 的种类, 比如 sshd.socket. 如果省略则 Systemd 默认后缀名为 .service, 所以 sshd 会被理解成 sshd.service.

** 配置文件的状态

#+BEGIN_EXAMPLE
systemctl list-unit-files  # 列出所有配置文件
systemctl list-unit-files --type=service  # 列出指定类型的配置文件
#+END_EXAMPLE

配置文件的状态一共有 4 种:
#+BEGIN_EXAMPLE
enabled: 已建立启动链接
disabled: 没建立启动链接
static: 该配置文件没有 [Install] 部分(无法执行), 只能作为其他配置文件的依赖
masked: 该配置文件被禁止建立启动链接
#+END_EXAMPLE

一旦修改配置文件, 就要让 systemd 重新加载配置文件, 然后重新启动.
#+BEGIN_EXAMPLE
sudo systemctl daemon-reload
sudo systemctl restart httpd.service
#+END_EXAMPLE

** 配置文件的区块

*** [Unit] 区块

用来定义 Unit 的元数据, 以及配置与其他 Unit 的关系. 主要字段有:
#+BEGIN_EXAMPLE
Description: 简短描述
Documentation: 文档地址
Requires: 当前 Unit 依赖的其他 Unit, 如果它们没有运行, 当前 Unit 会启动失败
Wants: 与当前 Unit 配合的其他 Unit, 如果它们没有运行, 当前 Unit 不会启动失败
BindsTo: 与Requires类似, 它指定的 Unit 如果退出, 会导致当前 Unit 停止运行
Before: 如果该字段指定的 Unit 也要启动, 那么必须在当前 Unit 之后启动
After: 如果该字段指定的 Unit 也要启动, 那么必须在当前 Unit 之前启动
Conflicts: 这里指定的 Unit 不能与当前 Unit 同时运行
Condition...: 当前 Unit 运行必须满足的条件, 否则不会运行
Assert...: 当前 Unit 运行必须满足的条件, 否则会报启动失败
#+END_EXAMPLE

