blog/OS/2019/04/01/systemd/ Or /blog/OS/systemd/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Systemd - Pinvon&#39;s Blog</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="pinvon" />
  <meta name="description" content="&lt;Add description here&gt;" />
  <meta name="keywords" content="OS" />
  <link rel="stylesheet" href="https://pinvondev.github.io/media/css/main.css" type="text/css"/>
  <link rel="stylesheet" href="https://pinvondev.github.io/media/css/comment.css" type="text/css"/>
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="https://pinvondev.github.io/">Pinvon&#39;s Blog</a></h1>
    <p>所见, 所闻, 所思, 所想</p>
    <nav class="site-nav">
      <div class="menu-icon">
        <svg viewBox="0 0 18 15">
          <path d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z" fill="#ffff00"/>
          <path d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z" fill="#ffff00"/>
          <path d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z" fill="#ffff00"/>
        </svg>
      </div>
      <ul class="trigger">
        <li><a href="https://pinvondev.github.io/years/">Years</a></li>
        <li><a href="https://pinvondev.github.io/authors/">Authors</a></li>
        <li><a href="https://pinvondev.github.io/tags/">Tags</a></li>
        <li><a href="https://pinvondev.github.io/about/">About</a></li>
        <li><a href="https://github.com/pinvondev">Github</a></li>
        <li><a href="https://pinvondev.github.io/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="pinvondev.github.io">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Systemd</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">概述</a></li>
<li><a href="#sec-2">系统管理</a>
<ul>
<li><a href="#sec-2-1">主命令 systemctl</a></li>
<li><a href="#sec-2-2">hostnamectl</a></li>
<li><a href="#sec-2-3">systemd-analyze</a></li>
<li><a href="#sec-2-4">localectl</a></li>
<li><a href="#sec-2-5">timedatectl</a></li>
<li><a href="#sec-2-6">loginctl</a></li>
</ul>
</li>
<li><a href="#sec-3">Unit</a></li>
<li><a href="#sec-4">Unit 配置文件</a>
<ul>
<li><a href="#sec-4-1">配置文件的名称</a></li>
<li><a href="#sec-4-2">配置文件的状态</a></li>
<li><a href="#sec-4-3">配置文件的区块</a>
<ul>
<li><a href="#sec-4-3-1">[Unit] 区块</a></li>
<li><a href="#sec-4-3-2">[Service] 区块</a></li>
<li><a href="#sec-4-3-3">[Install] 区块</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">Target</a></li>
<li><a href="#sec-6">日志管理</a></li>
<li><a href="#sec-7">配置文件内容</a>
<ul>
<li><a href="#sec-7-1">[Unit]区块: 启动顺序与依赖关系</a></li>
<li><a href="#sec-7-2">[Service]区块: 启动行为</a>
<ul>
<li><a href="#sec-7-2-1">启动命令</a>
<ul>
<li><a href="#sec-7-2-1-1">例子</a></li>
</ul>
</li>
<li><a href="#sec-7-2-2">启动类型</a>
<ul>
<li><a href="#sec-7-2-2-1">例子</a></li>
</ul>
</li>
<li><a href="#sec-7-2-3">重启行为</a></li>
</ul>
</li>
<li><a href="#sec-7-3">[Install]区块: 安装方式</a></li>
</ul>
</li>
<li><a href="#sec-8">修改配置文件后重启</a></li>
<li><a href="#sec-9">官方网站</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">概述</h2>
<div class="outline-text-2" id="text-1">
<p>
部分内容转自阮一峰老师的博客: <a href="http://www.ruanyifeng.com/blog/2016/03/systemd-tutorial-commands.html">http://www.ruanyifeng.com/blog/2016/03/systemd-tutorial-commands.html</a>
</p>

<p>
在历史上, Linux 的启动一直采用 init 进程, init 是 Linux 内核加载后执行的第一个进程, 以串行的方式对服务进行管理(启动, 停止, 监控等).
</p>

<p>
缺点:
</p>
<ul class="org-ul">
<li>以串行方式管理服务, 没有利用多 CPU 特性, 启动慢;
</li>
<li>只负责执行启动脚本, 脚本需要自己处理各种情况, 使得脚本变得很长;
</li>
<li>未体现服务间的依赖性;
</li>
<li>不同服务的启动顺序由服务本身设定, 且设定没有依据;
</li>
</ul>

<p>
Systemd 的设计目标: 为系统的启动和管理提供一套完整的解决方案, d 的含义就是要守护整个系统. 使用 Systemd 后, Systemd 成为系统的第一个进程(PID=1), 其他进程都是它的子进程. 它是一组命令, 涉及到系统管理的方方面面.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">系统管理</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">主命令 systemctl</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
sudo systemctl reboot  # 重启系统
sudo systemctl poweroff  # 关闭系统
sudo systemctl halt  # 停止 CPU
sudo systemctl suspend  # 暂停系统
sudo systemctl hibernate  # 休眠
...
</pre>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">hostnamectl</h3>
<div class="outline-text-3" id="text-2-2">
<p>
查看当前主机的信息.
</p>

<pre class="example">
hostnamectl  # 显示当前主机信息
sudo hostnamectl set-hostname pinvon  # 设置主机名
</pre>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">systemd-analyze</h3>
<div class="outline-text-3" id="text-2-3">
<p>
用于查看启动耗时.
</p>

<pre class="example">
systemd-analyze  # 查看启动耗时
systemd-analyze blame  # 查看每个服务的启动耗时
systemd-analyze critical-chain  # 显示瀑布状的启动过程流
systemd-analyze critical-chain atd.service  # 显示指定服务的启动流
</pre>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">localectl</h3>
<div class="outline-text-3" id="text-2-4">
<p>
用于本地化管理.
</p>

<pre class="example">
localectl  # 查看本地化设置

# 设置本地化参数。
sudo localectl set-locale LANG=en_GB.utf8
sudo localectl set-keymap en_GB
</pre>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">timedatectl</h3>
<div class="outline-text-3" id="text-2-5">
<p>
用于当前时间设置的管理.
</p>

<pre class="example">
timedatectl  # 查看当前时区设置
timedatectl list-timezones  # 显示所有可用的时区

# 设置当前时区
sudo timedatectl set-timezone America/New_York
sudo timedatectl set-time YYYY-MM-DD
sudo timedatectl set-time HH:MM:SS
</pre>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6">loginctl</h3>
<div class="outline-text-3" id="text-2-6">
<p>
用于查看当前登录用户.
</p>

<pre class="example">
loginctl list-sessions  # 列出当前session
loginctl list-users  # 列出当前登录用户
loginctl show-user ruanyf  # 列出显示指定用户的信息
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Unit</h2>
<div class="outline-text-2" id="text-3">
<p>
Systemd 可以管理所有系统资源, 资源统称为 Unit, 一共有 12 种.
</p>
<pre class="example">
Service Unit: 系统服务
Target Unit: 多个 Unit 构成的一个组
Device Unit: 硬件设备
Mount Unit: 文件系统的挂载点
Automount Unit: 自动挂载点
Path Unit: 文件或路径
Scope Unit: 不是由 Systemd 启动的外部进程
Slice Unit: 进程组
Snapshot Unit: Systemd 快照，可以切回某个快照
Socket Unit: 进程间通信的 socket
Swap Unit: swap 文件
Timer Unit: 定时器
</pre>

<p>
关于 Unit 的命令:
</p>
<pre class="example">
systemctl list-units  # 列出正在运行的 Unit
systemctl list-units --all  # 列出所有Unit，包括没有找到配置文件的或者启动失败的
systemctl list-units --all --state=inactive  # 列出所有没有运行的 Unit
systemctl list-units --failed  # 列出所有加载失败的 Unit
systemctl list-units --type=service  # 列出所有正在运行的、类型为 service 的 Unit


systemctl status  # 显示系统状态
sysystemctl status bluetooth.service  # 显示单个 Unit 的状态
systemctl -H root@rhel7.example.com status httpd.service  # 显示远程主机的某个 Unit 的状态


systemctl is-active application.service  # 显示某个 Unit 是否正在运行
systemctl is-failed application.service  # 显示某个 Unit 是否处于启动失败状态
systemctl is-enabled application.service  # 显示某个 Unit 服务是否建立了启动链接


sudo systemctl start apache.service  # 立即启动一个服务
sudo systemctl stop apache.service  # 立即停止一个服务
sudo systemctl restart apache.service  # 重启一个服务
sudo systemctl kill apache.service  # 杀死一个服务的所有子进程
sudo systemctl reload apache.service  # 重新加载一个服务的配置文件
sudo systemctl daemon-reload  # 重载所有修改过的配置文件
systemctl show httpd.service  # 显示某个 Unit 的所有底层参数
systemctl show -p CPUShares httpd.service  # 显示某个 Unit 的指定属性的值
sudo systemctl set-property httpd.service CPUShares=500  # 设置某个 Unit 的指定属性


systemctl list-dependencies --all nginx.service  # 列出一个 Unit 的所有依赖
</pre>
<p>
如果 Unit A 依赖于 Unit B, 则在启动 Unit A 时, 系统会同时去启动 Unit B.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Unit 配置文件</h2>
<div class="outline-text-2" id="text-4">
<p>
每个 Unit 都有一个配置文件, 告诉 Systemd 如何启动该 Unit.
</p>

<p>
Systemd 默认从 <i>etc/systemd/system</i> 读取配置文件, 但里面存放的大部分文件都是符号链接, 指向目录 <i>usr/lib/systemd/system</i>, 这才是真正的配置文件存放目录.
</p>

<p>
建立符号链接的命令:
</p>
<pre class="example">
sudo systemctl enable clamd@scan.service
# 等同于
sudo ln -s '/usr/lib/systemd/system/clamd@scan.service' '/etc/systemd/system/multi-user.target.wants/clamd@scan.service'
</pre>
<p>
如果配置文件内部配置了开机启动, 则 systemctl enable 相当于激活开机启动, 对应的, 如果使用 systemctl disable 命令撤销符号链接关系, 则相当于撤销了开机启动.
</p>
<pre class="example">
sudo systemctl disable clamd@scan.service
</pre>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">配置文件的名称</h3>
<div class="outline-text-3" id="text-4-1">
<p>
配置文件的后缀名就是该 Unit 的种类, 比如 sshd.socket. 如果省略则 Systemd 默认后缀名为 .service, 所以 sshd 会被理解成 sshd.service.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">配置文件的状态</h3>
<div class="outline-text-3" id="text-4-2">
<pre class="example">
systemctl list-unit-files  # 列出所有配置文件
systemctl list-unit-files --type=service  # 列出指定类型的配置文件
</pre>

<p>
配置文件的状态一共有 4 种:
</p>
<pre class="example">
enabled: 已建立启动链接
disabled: 没建立启动链接
static: 该配置文件没有 [Install] 部分(无法执行), 只能作为其他配置文件的依赖
masked: 该配置文件被禁止建立启动链接
</pre>

<p>
一旦修改配置文件, 就要让 systemd 重新加载配置文件, 然后重新启动.
</p>
<pre class="example">
sudo systemctl daemon-reload
sudo systemctl restart httpd.service
</pre>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">配置文件的区块</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1">[Unit] 区块</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
用来定义 Unit 的元数据, 以及配置与其他 Unit 的关系. 主要字段有:
</p>
<pre class="example">
Description: 简短描述
Documentation: 文档地址
Requires: 当前 Unit 依赖的其他 Unit, 如果它们没有运行, 当前 Unit 会启动失败
Wants: 与当前 Unit 配合的其他 Unit, 如果它们没有运行, 当前 Unit 不会启动失败
BindsTo: 与Requires类似, 它指定的 Unit 如果退出, 会导致当前 Unit 停止运行
Before: 如果该字段指定的 Unit 也要启动, 那么必须在当前 Unit 之后启动
After: 如果该字段指定的 Unit 也要启动, 那么必须在当前 Unit 之前启动
Conflicts: 这里指定的 Unit 不能与当前 Unit 同时运行
Condition...: 当前 Unit 运行必须满足的条件, 否则不会运行
Assert...: 当前 Unit 运行必须满足的条件, 否则会报启动失败
</pre>
</div>
</div>
